---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireTypeSet.GetEnumerator
source: html/2077b064-2ed3-cc47-7db0-749c83c6a401.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.